# IsFromRevitServer Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
RevitLinkType..::..IsFromRevitServer Method
RevitLinkType Class See Also
---
Checks whether the Revit link is located on Revit Server.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2015
# Syntax
C#
---
```text
public bool IsFromRevitServer()
```

Visual Basic
---
```text
Public Function IsFromRevitServer As Boolean
```

Visual C++
---
```text
public:
bool IsFromRevitServer()
```

# ### Return Value
Returns true if the Revit link is located on Revit Server.
# See Also
RevitLinkType Class
Autodesk.Revit.DB Namespace